app/views/administrators/post_categories/index.html.erb

SELECT  "post_categories".* FROM "post_categories" ORDER BY created_at DESC LIMIT $1 OFFSET $2
---
                        <ul>
                            <% category.post_categories.each do |category| %>