app/views/administrators/post_categories/new.html.erb

SELECT "post_categories".* FROM "post_categories"
---
                                <label for="product_edit_name_control">Родительская категория</label>
                                <%= f.select :post_category_id , @post_category.access_categores,{include_blank: 'Не выбрано'}, {"data-md-selectize ": true} %>