app/views/administrators/sliders/index.html.erb

                        <tr>
                            <td><%= slider.slides.size %></td>
---
SELECT COUNT(*) FROM "slides" WHERE "slides"."slider_id" = $1