app/services/site/s_order/create.rb

      def main
        add_static_data_to_order
        if @order.save and @cart.line_items.size > 0
---
INSERT INTO "orders" ("created_at", "updated_at", "customer_name", "customer_email", "customer_phone", "customer_city", "total_price", "customer_address") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

      def add_items_to_order
         @cart.line_items.each do |item|
          item.update(order_id: @order.id, cart_id: nil)
          item.save
        end
        @cart.destroy
---
UPDATE "line_items" SET "cart_id" = $1, "order_id" = $2 WHERE "line_items"."id" = $3
DELETE FROM "carts" WHERE "carts"."id" = $1