app/services/site/s_order/create_quick.rb

      def initialize(params)
        @params = params
        @product = Product.find(params[:product_id]) rescue nil
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2

      def update_product
        @product.qty -= 1
        @product.stock = false if @product.qty == 0
        @product.save
---
UPDATE "products" SET "qty" = $1, "updated_at" = $2 WHERE "products"."id" = $3

      def create_order
        @order = Order.create(customer_phone: @params[:customer_phone], total_price: @product.price, size_type: 1)
        LineItem.create(order_id: @order.id, product_id: @product.id, product_name: @product.name,
                        product_price: @product.price, quantity: 1, total_price: @product.price )
---
INSERT INTO "orders" ("created_at", "updated_at", "customer_phone", "total_price", "size_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "line_items" ("product_id", "order_id", "product_name", "product_price", "total_price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"