app/views/site/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1
---

<% @cart.line_items.each do |item| %>

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1
---

 <%= @cart.line_items.collect{|item| [item.product_id]} %>