app/views/administrators/product_categories/index.html.erb

SELECT "product_categories".* FROM "product_categories"
---
                        <ul>
                            <% category.product_categories.each do |category| %>