app/views/administrators/product_categories/new.html.erb

                                <label for="product_edit_name_control">Родительская категория</label>
                                <%= f.select :product_category_id , ProductCategory.all.collect{|category| [category.name, category.id]} << ['Родитель', 0],{include_blank: 'Не выбрано'}, {"data-md-selectize ": true} %>
---
SELECT "product_categories".* FROM "product_categories"