app/controllers/site/carts_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 16]]
---
  def show
    @order = Order.new
    @line_items = @cart.line_items.includes(:product)