app/controllers/site/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 444]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-04-09 11:50:02.466533"], ["updated_at", "2017-04-09 11:50:02.466533"]]
---
  def create
    product = Product.friendly.find(params[:product_id])
    @line_item = LineItem.new(cart_id: @cart.id, product_id: product.id, product_name: product.name,
     product_sku: product.sku, product_price: product.price)
    respond_to do |format|
      if @line_item.save