app/controllers/site/post_categories_controller.rb

SELECT "post_categories".* FROM "post_categories"
SELECT "posts".* FROM "posts" WHERE "posts"."post_category_id" = $1  [["post_category_id", 114]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."post_category_id" = $1  [["post_category_id", 114]]
SELECT  "posts".* FROM "posts" LIMIT $1  [["LIMIT", 3]]
---
  def show
    @post_categories = PostCategory.all
    @post_category = PostCategory.friendly.find(params[:id])
    @posts = @post_category.posts.paginate(page: params[:page], per_page: 10)
    @random_posts = Post.limit(3)