app/controllers/site/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2
SELECT  "posts".* FROM "posts" LIMIT $1  [["LIMIT", 3]]
---
  def show
    @post = Post.friendly.find(params[:id])
    @post_category = @post.post_category
    @random_posts = Post.limit(3)