app/controllers/site/product_categories_controller.rb

  def show
    @product_category = ProductCategory.friendly.find(params[:id])
    @products = @product_category.products.paginate(page: params[:page], per_page: 10)
    @parent_product_categories = ProductCategory.where(product_category_id: 0)
    @subcategories = @product_category.product_categories
    @banner = Banner.find_by(descriptor: "first_banner")
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_category_id" = $1  [["product_category_id", 0]]
SELECT  "products".* FROM "products" WHERE "products"."product_category_id" = $1 LIMIT $2 OFFSET $3  [["product_category_id", 550], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."product_category_id" = $1  [["product_category_id", 550]]
SELECT  "banners".* FROM "banners" WHERE "banners"."descriptor" = $1 LIMIT $2