app/controllers/site/products_controller.rb

	def show
		@product = Product.friendly.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 445]]