app/controllers/site/static_pages_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."descriptor" = $1 LIMIT $2
SELECT  "sliders".* FROM "sliders" WHERE "sliders"."descriptor" = $1 LIMIT $2
SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT $1
---
  def home
    @page = Page.find_by(descriptor: 'home')
    @slides = Slider.find_by(descriptor: 'main').slides
    @new_products = Product.last(5)

SELECT  "pages".* FROM "pages" WHERE "pages"."descriptor" = $1 LIMIT $2
---
  def contacts
    @page = Page.find_by(descriptor: 'contacts')

SELECT  "pages".* FROM "pages" WHERE "pages"."descriptor" = $1 LIMIT $2
---
  def company_info
    @page = Page.find_by(descriptor: 'company_info')

SELECT  "pages".* FROM "pages" WHERE "pages"."descriptor" = $1 LIMIT $2
---
  def delivery_info
    @page = Page.find_by(descriptor: 'delivery_info')

SELECT  "pages".* FROM "pages" WHERE "pages"."descriptor" = $1 LIMIT $2
---
  def payment_info
    @page = Page.find_by(descriptor: 'payment_info')