app/helpers/current_cart.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"
---
  def set_cart
    @cart = Cart.find(session[:cart_id])
  rescue ActiveRecord::RecordNotFound
    @cart = Cart.create