app/services/site/s_cart/add_product.rb

UPDATE "products" SET "qty" = $1, "stock" = $2, "updated_at" = $3 WHERE "products"."id" = $4
---
      def update_product
        @product.qty -= 1
        @product.stock = false if @product.qty == 0
        @product.save

INSERT INTO "line_items" ("product_id", "cart_id", "product_name", "product_price", "total_price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
      def update_current_line_item(current_item)
        current_item.quantity += 1
        current_item.total_price += @product.price
        current_item.save