app/services/site/s_cart/add_product.rb

UPDATE "products" SET "qty" = $1, "updated_at" = $2 WHERE "products"."id" = $3
---
      def update_product
        @product.qty -= 1
        @product.stock = false if @product.qty == 0
        @product.save