app/services/site/s_cart/delete_item.rb

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."id" = $2 LIMIT $3
---
      def initialize(line_item_id, cart)
        @cart = cart
        @line_item = @cart.line_items.find(line_item_id) rescue nil

DELETE FROM "line_items" WHERE "line_items"."id" = $1
---
      def main
        if @line_item != nil
          @line_item.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2
UPDATE "products" SET "qty" = $1, "stock" = $2, "updated_at" = $3 WHERE "products"."id" = $4
---
      def update_product
        product = Product.find(@line_item.product_id)
        product.stock = true if product.qty == 0
        product.qty += @line_item.quantity
        product.save