app/services/site/s_cart/delete_cart.rb

DELETE FROM "carts" WHERE "carts"."id" = $1
---
      def main
       update_qty_from_products if @line_items.size > 0
       @cart.destroy