app/services/site/search_product.rb

    def search_by_sku
      product = Product.friendly.find_by(id: @search_value, active: true) rescue false
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 AND "products"."active" = $2 LIMIT $3