app/views/administrators/menu_items/edit.html.erb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" = $1 AND "menu_items"."menu_item_id" = $2  [["menu_id", 3], ["menu_item_id", 0]]
---
                        <ul>
                            <% item.menu_items.each do |item| %>