app/controllers/site_controller.rb

SELECT  "menus".* FROM "menus" WHERE "menus"."descriptor" = $1 LIMIT $2
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2
---
  def all_pages_data
    @main_menu_items   = Menu.find_by(descriptor: 'main_menu').menu_items.where(ancestry: nil)
    @footer_menu_items = Menu.find_by(descriptor: 'footer_menu').menu_items
    @minicart          = Cart.find(session[:cart_id]) if session[:cart_id]