app/models/cart.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1
---
  def delete_product(product_id)
    Line_item.find(product_id).destroy