app/models/menu_item.rb

INSERT INTO "menu_items" ("title", "url") VALUES ($1, $2) RETURNING "id"
---

end

MenuItem.create(title: 'zz', url: '/', position: 1)