app/models/product.rb

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1 AND "line_items"."product_id" = $2 LIMIT $3
---
  def in_cart?(cart)
    if cart.line_items
      cart.line_items.find_by(product_id: self.id) ? true : false