app/controllers/administrators/back_calls_controller.rb

  def index
    @back_calls = BackCall.all.paginate(:page => params[:page], :per_page => 20)
---
SELECT  "back_calls".* FROM "back_calls" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "back_calls"

  def destroy
    @back_call.destroy
---
DELETE FROM "back_calls" WHERE "back_calls"."id" = $1  [["id", 28]]

  def set_back_call
    @back_call = BackCall.find(params[:id])
---
SELECT  "back_calls".* FROM "back_calls" WHERE "back_calls"."id" = $1 LIMIT 1  [["id", 28]]