app/controllers/administrators/form_requests_controller.rb

SELECT  "form_requests".* FROM "form_requests" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "form_requests"
---
  def index
    @form_requests = FormRequest.all.paginate(:page => params[:page], :per_page => 20)

DELETE FROM "form_requests" WHERE "form_requests"."id" = $1  [["id", 21]]
---
  def destroy
    @request.destroy

SELECT  "form_requests".* FROM "form_requests" WHERE "form_requests"."id" = $1 LIMIT $2
---
  def set_form_request
    @request = FormRequest.find(params[:id])