app/controllers/administrators/menu_items_controller.rb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" = $1 AND "menu_items"."menu_item_id" = $2  [["menu_id", 3], ["menu_item_id", 0]]
---
  def edit
    @parent_menu_parent_items = MenuItem.where(menu_id: @menu_item.menu_id, menu_item_id: 0)

UPDATE "menu_items" SET "menu_item_id" = $1 WHERE "menu_items"."id" = $2  [["menu_item_id", 0], ["id", 2]]
---
  def update
    SAdministrator::SMenuItem::Update.new(@menu_item, params).main
    respond_to do |format|
      if @menu_item.save

SELECT "menus".* FROM "menus"
---
  def new
    @menu_item = MenuItem.new()
    @menus     = Menu.all.collect{|item| [item.name, item.id ]}

INSERT INTO "menu_items" ("title", "menu_id", "url", "menu_item_id", "position") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Контакты"], ["menu_id", 1], ["url", "/contacts"], ["menu_item_id", nil], ["position", 2]]
---
  def create
    @menu_item = MenuItem.new()
    SAdministrator::SMenuItem::Create.new(@menu_item, params).main
    respond_to do |format|
      if @menu_item.save

DELETE FROM "menu_items" WHERE "menu_items"."id" = $1
---
  def destroy
    @menu_item.destroy

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2
---
  def set_menu_item
    @menu_item = MenuItem.find(params[:id])