app/controllers/administrators/menus_controller.rb

  def index
    @menus = Menu.includes(:menu_items)
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" IN (3, 4)
SELECT "menus".* FROM "menus"

  def edit
    @menu = Menu.find(params[:id])
  	@menu_items    = @menu.menu_items.all.order(:position)
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" = $1 AND "menu_items"."menu_item_id" = $2  ORDER BY "menu_items"."position" ASC  [["menu_id", 3], ["menu_item_id", 0]]