app/controllers/administrators/menu_items_controller.rb

SELECT "menu_items".* FROM "menu_items"
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2
---
  def edit
    @parent_menu_parent_items = MenuItem.where(menu_id: @menu_item.menu_id, menu_item_id: 0)
    @patent_menu_items_list =  MenuItem.all.collect {|item| [item.title, item.id ]} << ['Родитель', 0]