app/controllers/administrators/orders_controller.rb

  def index
    @orders = Order.all.order(:created_at).paginate(:page => params[:page], :per_page => 20)
---
SELECT  "orders".* FROM "orders"  ORDER BY "orders"."created_at" ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def show
    @products = Product.all.limit(3)
---
SELECT  "products".* FROM "products" LIMIT 3