app/controllers/administrators/pages_controller.rb

UPDATE "pages" SET "description" = $1, "meta_title" = $2, "meta_description" = $3, "meta_keywords" = $4 WHERE "pages"."id" = $5  [["description", ""], ["meta_title", "11"], ["meta_description", "22"], ["meta_keywords", "33"], ["id", 2]]
---
  def update
    @page.update(page_params)

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_page
    @page = Page.find(params[:id])