app/controllers/administrators/post_categories_controller.rb

  def index
    @post_categories = PostCategory.all
---
SELECT "post_categories".* FROM "post_categories" WHERE "post_categories"."post_category_id" = $1  [["post_category_id", 0]]

  def create
    @post_category = PostCategory.new(post_category_params)
    respond_to do |format|
      if @post_category.save
---
INSERT INTO "post_categories" ("name", "post_category_id", "slug", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "4324324"], ["post_category_id", 110], ["slug", "342432"], ["description", "3242343234"], ["created_at", "2017-04-06 06:58:36.571438"], ["updated_at", "2017-04-06 06:58:36.571438"]]

  def update
    @post_category.update(post_category_params)
---
UPDATE "post_categories" SET "meta_title" = $1, "meta_description" = $2, "meta_keywords" = $3, "updated_at" = $4 WHERE "post_categories"."id" = $5  [["meta_title", "11"], ["meta_description", "22"], ["meta_keywords", "33"], ["updated_at", "2017-03-22 07:58:09.031753"], ["id", 5]]

  def destroy
    PostCategory.find(params[:id]).destroy
---
DELETE FROM "post_categories" WHERE "post_categories"."id" = $1  [["id", 21]]
SELECT "post_categories".* FROM "post_categories" WHERE "post_categories"."post_category_id" = $1  [["post_category_id", 21]]

  def set_post_category
    @post_category = Administrators::PostCategoryDecorator.decorate(PostCategory.friendly.find(params[:id]))
---
SELECT  "administrators".* FROM "administrators" WHERE "administrators"."id" = $1  ORDER BY "administrators"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "post_categories".* FROM "post_categories" WHERE "post_categories"."id" = $1 LIMIT 1  [["id", 20]]