app/controllers/administrators/post_categories_controller.rb

SELECT  "post_categories".* FROM "post_categories"  ORDER BY "post_categories"."name" ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "post_categories"
---
  def index
    @post_categories = PostCategory.all.order(:name).paginate(:page => params[:page], :per_page => 20)

SELECT "post_categories".* FROM "post_categories"
---
  def new
    @post_category = PostCategory.new()
    @list_to_form = PostCategory.all.collect{|category| [category.name, category.id]} << ['Родитель', 0]

SELECT "post_categories".* FROM "post_categories"
---
  def edit
    @list_to_form = PostCategory.all.collect{|category| [category.name, category.id]} << ['Родитель', 0]