app/controllers/administrators/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.paginate(:page => params[:page], :per_page => 20)

SELECT "post_categories".* FROM "post_categories"
---
  def new
    @post = Post.new()
    @access_categores = PostCategory.all.collect{|category| [category.name, category.id]} << ['Без категории', 0]

INSERT INTO "posts" ("name", "post_category_id", "slug", "content", "avatar", "meta_title", "meta_description", "meta_keywords", "lead", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "avatar" = $1, "updated_at" = $2 WHERE "posts"."id" = $3
---
  def update
    @post.update(post_params)

SELECT "post_categories".* FROM "post_categories"
---
  def edit
    @access_categores = PostCategory.all.collect{|category| [category.name, category.id]} << ['Без категории', 0]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2
---
  def set_post_category
    @post = Post.friendly.find(params[:id])