app/controllers/administrators/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.includes(:product_category).order(:name).paginate(:page => params[:page], :per_page => 20)
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."product_category_id" = $1 ORDER BY "product_categories"."name" ASC LIMIT $2  [["product_category_id", 0], ["LIMIT", 100]]
SELECT COUNT(*) FROM "product_categories"

  def new
    @product_category = ProductCategory.new()
    @list_to_form     = ProductCategory.all.collect{|category| [category.name, category.id]} << ['Родитель', 0]
---
SELECT "product_categories".* FROM "product_categories"

  def create
    @product_category = ProductCategory.new(product_category_params)
    respond_to do |format|
      if @product_category.save
---
INSERT INTO "product_categories" ("name", "slug", "avatar", "description", "large_avatar") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @product_category.update(product_category_params)
---
UPDATE "product_categories" SET "large_avatar" = $1 WHERE "product_categories"."id" = $2

  def edit
    @list_to_form = ProductCategory.all.collect{|category| [category.name, category.id]} << ['Родитель', 0]
---
SELECT "product_categories".* FROM "product_categories"

  def destroy
    @product_category.destroy
---
DELETE FROM "product_categories" WHERE "product_categories"."id" = $1  [["id", 363]]

  def set_product_category
    @product_category = ProductCategory.friendly.find(params[:id])
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_category_id" = $1  [["product_category_id", 542]]