app/controllers/administrators/product_attacments_controller.rb

SELECT  "product_attachments".* FROM "product_attachments" WHERE "product_attachments"."id" = $1 LIMIT 1  [["id", 63]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 221]]
DELETE FROM "product_attachments" WHERE "product_attachments"."id" = $1  [["id", 63]]
---
  def destroy
    attacment = ProductAttachment.find(params[:id])
    product = Product.find(attacment.product_id)
    product.gallery.delete(attacment.image)