app/controllers/administrators/product_questions_controller.rb

SELECT  "product_questions".* FROM "product_questions"  ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "product_questions"
---
  def index
    @product_questions = ProductQuestion.all.order('created_at DESC').paginate(:page => params[:page], :per_page => 20)

DELETE FROM "product_questions" WHERE "product_questions"."id" = $1  [["id", 23]]
---
  def destroy
    @product_question.destroy

SELECT  "product_questions".* FROM "product_questions" WHERE "product_questions"."id" = $1 LIMIT 1  [["id", 23]]
---
  def set_product_question
    @product_question = ProductQuestion.find(params[:id])