app/controllers/administrators/products_controller.rb

SELECT  "products".* FROM "products"  ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    @actions = [['Удалить', 0], ['Опубликовать', 1], ['Снять с публикации', 2]]
    @products = Product.paginate(:page => params[:page], :per_page => 30)

SELECT "product_attachments".* FROM "product_attachments" WHERE "product_attachments"."product_id" = $1  [["product_id", 190]]
SELECT "product_categories".* FROM "product_categories"
---
  def edit
    @product_attachments = ProductAttachment.where(product_id: @product.id)
    @product_categories  = ProductCategory.all.collect {|category| [category.name, category.id ]}

UPDATE "products" SET "name" = $1, "product_category_id" = $2, "sku" = $3, "description" = $4, "avatar" = $5, "slug" = $6, "updated_at" = $7 WHERE "products"."id" = $8  [["name", "test_product1"], ["product_category_id", 0], ["sku", ""], ["description", ""], ["avatar", nil], ["slug", ""], ["updated_at", "2017-03-20 11:00:40.484179"], ["id", 1]]
---
  def update
    SAdministrator::SProduct::Update.new(@product, params).main
    respond_to do |format|
      if @product.save

SELECT "product_categories".* FROM "product_categories"
---
  def new
    @product = Product.new
    @product_categories  = ProductCategory.all.collect {|category| [category.name, category.id ]}

INSERT INTO "products" ("name", "price", "description", "avatar", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "2313"], ["price", "0.0"], ["description", ""], ["avatar", nil], ["slug", ""], ["created_at", "2017-04-05 12:43:43.401803"], ["updated_at", "2017-04-05 12:43:43.401803"]]
---
  def create
    @product = Product.new
    SAdministrator::SProduct::Create.new(@product, params).main
    respond_to do |format|
      if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 222]]
---
  def set_product
    @product = Product.friendly.find(params[:id])