app/controllers/administrators/products_controller.rb

SELECT  "products".* FROM "products"  ORDER BY "products"."name" ASC LIMIT 20 OFFSET 0
---
  def index
    @actions = [['Удалить', 0], ['Опубликовать', 1], ['Снять с публикации', 2]]
    @products = Product.order(:name).paginate(:page => params[:page], :per_page => 20)