app/controllers/administrators/product_categories_controller.rb

  def update
    @product_category.update(product_category_params)
---
UPDATE "product_categories" SET "description" = $1, "large_avatar" = $2 WHERE "product_categories"."id" = $3