app/controllers/administrators/site_variables_controller.rb

SELECT "site_variables".* FROM "site_variables"
---
  def index
    @site_variables = SiteVariable.all

UPDATE "site_variables" SET "title" = $1, "content" = $2 WHERE "site_variables"."id" = $3  [["title", "Телефон в шапке1"], ["content", "8-800-555-35-351"], ["id", 1]]
---
  def update
    @site_variable.update(site_variable_params)

SELECT  "site_variables".* FROM "site_variables" WHERE "site_variables"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_site_variable
    @site_variable = SiteVariable.find(params[:id])