app/controllers/administrators/slides_controller.rb

  def edit
    @sliders = Slider.all.collect {|slide| [slide.name, slide.id ]}
---
SELECT "sliders".* FROM "sliders"

  def destroy
    @slide.destroy
---
DELETE FROM "slides" WHERE "slides"."id" = $1  [["id", 2]]

  def new
    @slide = Slide.new
    @sliders = Slider.all.collect {|slide| [slide.name, slide.id ]}
---
SELECT "sliders".* FROM "sliders"

  def create
    @slide = Slide.new(slide_params)
    respond_to do |format|
      if @slide.save
---
INSERT INTO "slides" ("name", "image", "slider_id") VALUES ($1, $2, $3) RETURNING "id"  [["name", "34242"], ["image", "nastol.com.ua_177698.jpg"], ["slider_id", 4]]

  def update
    @slide.update(slide_params)
---
UPDATE "slides" SET "image" = $1 WHERE "slides"."id" = $2  [["image", "nastol.com.ua_177704.jpg"], ["id", 1]]

  def set_slider
    @slide = Slide.find(params[:id])
---
SELECT  "slides".* FROM "slides" WHERE "slides"."id" = $1 LIMIT 1  [["id", 2]]