app/views/administrators/menus/edit.html.erb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_item_id" = $1
---
                        <ul>
                            <% item.menu_items.each do |item| %>