app/views/administrators/menus/index.html.erb

                            <tr>
                                <td><%= menu.menu_items.size %></td>
---
SELECT COUNT(*) FROM "menu_items" WHERE "menu_items"."menu_id" = $1  [["menu_id", 3]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" IN (3, 4)
SELECT "menus".* FROM "menus"